# Pandas

Pandas is a high-level data manipulation tool developed by Wes McKinney. It is built on the Numpy package and its key data structure is called the DataFrame. DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1=pd.DataFrame([[1,2,3,4],[4,5,6,7],[1,5,4,8],[3,7,8,2],[1,2,3,4],[4,5,6,7],[1,5,4,8],[3,7,8,2]])

In [5]:
print(df1)

   0  1  2  3
0  1  2  3  4
1  4  5  6  7
2  1  5  4  8
3  3  7  8  2
4  1  2  3  4
5  4  5  6  7
6  1  5  4  8
7  3  7  8  2

In [6]:
df1.head()

   0  1  2  3
0  1  2  3  4
1  4  5  6  7
2  1  5  4  8
3  3  7  8  2
4  1  2  3  4

In [7]:
df1.tail()

   0  1  2  3
3  3  7  8  2
4  1  2  3  4
5  4  5  6  7
6  1  5  4  8
7  3  7  8  2

In [8]:
df1.head(3)

   0  1  2  3
0  1  2  3  4
1  4  5  6  7
2  1  5  4  8

In [9]:
df1.tail(3)

   0  1  2  3
5  4  5  6  7
6  1  5  4  8
7  3  7  8  2

In [10]:
df2=pd.DataFrame([[1,2,3,4],[4,5,6,7],[1,5,4,8],[3,7,8,2]],columns=["color","shape","texture","surface"])

In [11]:
print(df2)

   color  shape  texture  surface
0      1      2        3        4
1      4      5        6        7
2      1      5        4        8
3      3      7        8        2

Reading a csv file in python with pandas

In [12]:
df3=pd.read_csv('multi_var_regression1.csv')

In [13]:
print(df3)

    Year  Month  Interest_Rate  Unemployment_Rate  Stock_Index_Price
0   2017     12           2.75                5.3               1464
1   2017     11           2.50                5.3               1394
2   2017     10           2.50                5.3               1357
3   2017      9           2.50                5.3               1293
4   2017      8           2.50                5.4               1256
5   2017      7           2.50                5.6               1254
6   2017      6           2.50                5.5               1234
7   2017      5           2.25                5.5               1195
8   2017      4           2.25                5.5               1159
9   2017      3           2.25                5.6               1167
10  2017      2           2.00                5.7               1130
11  2017      1           2.00                5.9               1075
12  2016     12           2.00                6.0               1047
13  2016     11           1.75                5.9                965
14  2016     10           1.75                5.8                943
15  2016      9           1.75                6.1                958
16  2016      8           1.75                6.2                971
17  2016      7           1.75                6.1                949
18  2016      6           1.75                6.1                884
19  2016      5           1.75                6.1                866
20  2016      4           1.75                5.9                876
21  2016      3           1.75                6.2                822
22  2016      2           1.75                6.2                704
23  2016      1           1.75                6.1                719

In [14]:
df3.head()

   Year  Month  Interest_Rate  Unemployment_Rate  Stock_Index_Price
0  2017     12           2.75                5.3               1464
1  2017     11           2.50                5.3               1394
2  2017     10           2.50                5.3               1357
3  2017      9           2.50                5.3               1293
4  2017      8           2.50                5.4               1256

In [15]:
df3.tail()

    Year  Month  Interest_Rate  Unemployment_Rate  Stock_Index_Price
19  2016      5           1.75                6.1                866
20  2016      4           1.75                5.9                876
21  2016      3           1.75                6.2                822
22  2016      2           1.75                6.2                704
23  2016      1           1.75                6.1                719